# WoodLatewoodRatio Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodLatewoodRatio Property
AdvancedWood Class See Also
---
The property labeled "Percentage of latewood in each ring" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodLatewoodRatio { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodLatewoodRatio As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodLatewoodRatio {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace